# Задача 2: Найдите сумму цифр трехзначного числа. 

number = 100
result = sum(int(num) for num in str(number))
print(result)